# MultiReferenceAnnotationType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..MultiReferenceAnnotationType Property
MultiReferenceAnnotationOptions Class See Also
---
The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MultiReferenceAnnotationType MultiReferenceAnnotationType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MultiReferenceAnnotationType As MultiReferenceAnnotationType
	Get
```

Visual C++
---
```text
public:
property MultiReferenceAnnotationType^ MultiReferenceAnnotationType {
	MultiReferenceAnnotationType^ get ();
}
```

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace